IDEA Open Model
CrossSectionCreepCoefficientData Class
Compatible with IDEA StatiCa 20.1
 Cross-section component creep coefficient data
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientData
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CrossSectionCreepCoefficientData
Public Class CrossSectionCreepCoefficientData
The CrossSectionCreepCoefficientData type exposes the following members.
Constructors
Name | Description
CrossSectionCreepCoefficientData
Initializes a new instance of the CrossSectionCreepCoefficientData class
Top
Properties
Name | Description
ComponentIndex
 Zero based index of component
CreepInput
 User-defined curvature for creep coefficient { x = t[day], y = ϕ }
Humidity
 Humidity in the relative value
NotionalSize
 User-defined notional size
NotionalSizeInput
 Input type of Notional size
UserCreepCoeeficient
 User creep coefficient
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace